[{"ref":"1 Nephi 11:17 ","scripture":"And I said unto him: I know that he loveth his children; nevertheless, I do not know the meaning of all things.","used":false},{"ref":"1 Nephi 20:10 ","scripture":"For, behold, I have refined thee, I have chosen thee in the furnace of affliction.","used":false},{"ref":"1 Nephi 21:13 ","scripture":"Sing, O heavens; and be joyful, O earth; for the feet of those who are in the east shall be established; and break forth into singing, O mountains; for they shall be smitten no more; for the Lord hath comforted his people, and will have mercy upon his afflicted.","used":false},{"ref":"1 Nephi 9:6 ","scripture":"But the Lord knoweth all things from the beginning; wherefore, he prepareth a way to accomplish all his works among the children of men; for behold, he hath all power unto the fulfilling of all his words. And thus it is. Amen.","used":false},{"ref":"2 Nephi 26:28 ","scripture":"Behold, hath the Lord commanded any that they should not partake of his goodness? Behold I say unto you, Nay; but all men are privileged the one like unto the other, and none are forbidden.","used":false},{"ref":"2 Nephi 2:2 ","scripture":"Nevertheless, Jacob, my firstborn in the wilderness, thou knowest the greatness of God; and he shall consecrate thine afflictions for thy gain.","used":false},{"ref":"2 Nephi 2:25 ","scripture":"Adam fell that men might be; and men are, that they might have joy.","used":false},{"ref":"2 Nephi 31:3 ","scripture":"For my soul delighteth in plainness; for after this manner doth the Lord God work among the children of men. For the Lord God giveth light unto the understanding; for he speaketh unto men according to their language, unto their understanding.","used":false},{"ref":"3 Nephi 22:13 ","scripture":"And all thy children shall be taught of the Lord; and great shall be the peace of thy children.","used":false},{"ref":"Alma 40:23 ","scripture":"The soul shall be restored to the body, and the body to the soul; yea, and every limb and joint shall be restored to its body; yea, even a hair of the head shall not be lost; but all things shall be restored to their proper and perfect frame.","used":false},{"ref":"Alma 42:8 ","scripture":"Now behold, it was not expedient that man should be reclaimed from this temporal death, for that would destroy the great plan of happiness.","used":false},{"ref":"Alma 7:11 ","scripture":"And he shall go forth, suffering pains and afflictions and temptations of every kind; and this that the word might be fulfilled which saith he will take upon him the pains and the sicknesses of his people.","used":false},{"ref":"Mosiah 23:18 ","scripture":"Therefore they did watch over their people, and did nourish them with things pertaining to righteousness.","used":false},{"ref":"Mormon 5:23 ","scripture":"Know ye not that ye are in the hands of God? Know ye not that he hath all power, and at his great command the earth shall be rolled together as a scroll?","used":false},{"ref":"Moroni 7:41 ","scripture":"And what is it that ye shall hope for? Behold I say unto you that ye shall have hope through the atonement of Christ and the power of his resurrection, to be raised unto life eternal, and this because of your faith in him according to the promise.","used":false},{"ref":"Mosiah 4:9 ","scripture":"Believe in God; believe that he is, and that he created all things, both in heaven and in earth; believe that he has all wisdom, and all power, both in heaven and in earth; believe that man doth not comprehend all the things which the Lord can comprehend.","used":false},{"ref":"Alma 37:36 ","scripture":"Yea, and cry unto God for all thy support; yea, let all thy doings be unto the Lord, and whithersoever thou goest let it be in the Lord; yea, let all thy thoughts be directed unto the Lord; yea, let the affections of thy heart be placed upon the Lord forever.","used":false},{"ref":"Ether 12:8 ","scripture":"But because of the faith of men he has shown himself unto the world, and glorified the name of the Father, and prepared a way that thereby others might be partakers of the heavenly gift, that they might hope for those things which they have not seen.","used":false},{"ref":"Mosiah 24:15 ","scripture":"And now it came to pass that the burdens which were laid upon Alma and his brethren were made light; yea, the Lord did strengthen them that they could bear up their burdens with ease, and they did submit cheerfully and with patience to all the will of the Lord.","used":false},{"ref":"1 Nephi 21:16 ","scripture":"Behold, I have graven thee upon the palms of my hands; thy walls are continually before me.","used":false},{"ref":"Mormon 9:12 ","scripture":"Behold, he created Adam, and by Adam came the fall of man. And because of the fall of man came Jesus Christ, even the Father and the Son; and because of Jesus Christ came the redemption of man.","used":false},{"ref":"Moroni 7:10 ","scripture":"Wherefore, a man being evil cannot do that which is good; neither will he give a good gift.","used":false},{"ref":"Alma 30:60 ","scripture":"And thus we see the end of him who perverteth the ways of the Lord; and thus we see that the devil will not support his children at the last day, but doth speedily drag them down to hell.","used":false},{"ref":"2 Nephi 31:7 ","scripture":"Know ye not that he was holy? But notwithstanding he being holy, he showeth unto the children of men that, according to the flesh he humbleth himself before the Father, and witnesseth unto the Father that he would be obedient unto him in keeping his commandments.","used":false},{"ref":"Alma 5:62 ","scripture":"I speak by way of command unto you that belong to the church; and unto those who do not belong to the church I speak by way of invitation, saying: Come and be baptized unto repentance, that ye also may be partakers of the fruit of the tree of life.","used":false},{"ref":"2 Nephi 2:7 ","scripture":"Behold, he offereth himself a sacrifice for sin, to answer the ends of the law, unto all those who have a broken heart and a contrite spirit; and unto none else can the ends of the law be answered.","used":false},{"ref":"2 Nephi 32:3 ","scripture":"Angels speak by the power of the Holy Ghost; wherefore, they speak the words of Christ. Wherefore, I said unto you, feast upon the words of Christ; for behold, the words of Christ will tell you all things what ye should do.","used":false},{"ref":"2 Nephi 31:15 ","scripture":"And I heard a voice from the Father, saying: Yea, the words of my Beloved are true and faithful. He that endureth to the end, the same shall be saved.","used":false},{"ref":"Alma 39:17 ","scripture":"And now I will ease your mind somewhat on this subject. Behold, you marvel why these things should be known so long beforehand. Behold, I say unto you, is not a soul at this time as precious unto God as a soul will be at the time of his coming?","used":false},{"ref":"Alma 32:15 ","scripture":"Yea, he that truly humbleth himself, and repenteth of his sins, and endureth to the end, the same shall be blessed—yea, much more blessed than they who are compelled to be humble because of their exceeding poverty.","used":true},{"ref":"Alma 5:13 ","scripture":"And behold, he preached the word unto your fathers, and a mighty change was also wrought in their hearts, and they humbled themselves and put their trust in the true and living God. And behold, they were faithful until the end; therefore they were saved.","used":true},{"ref":"1 Nephi 7:12 ","scripture":"Yea, and how is it that ye have forgotten that the Lord is able to do all things according to his will, for the children of men, if it so be that they exercise faith in him? Wherefore, let us be faithful to him.","used":false},{"ref":"Alma 32:21 ","scripture":"And now as I said concerning faith—faith is not to have a perfect knowledge of things; therefore if ye have faith ye hope for things which are not seen, which are true.","used":false},{"ref":"Ether 12:6 ","scripture":"And now, I, Moroni, would speak somewhat concerning these things; I would show unto the world that faith is things which are hoped for and not seen; wherefore, dispute not because ye see not, for ye receive no witness until after the trial of your faith.","used":false},{"ref":"Moroni 7:33 ","scripture":"And Christ hath said: If ye will have faith in me ye shall have power to do whatsoever thing is expedient in me.","used":false},{"ref":"2 Nephi 25:26 ","scripture":"And we talk of Christ, we rejoice in Christ, we preach of Christ, we prophesy of Christ, and we write according to our prophecies, that our children may know to what source they may look for a remission of their sins.","used":false},{"ref":"Alma 34:32 ","scripture":"For behold, this life is the time for men to prepare to meet God; yea, behold the day of this life is the day for men to perform their labors.","used":false},{"ref":"Alma 37:35 ","scripture":"O, remember, my son, and learn wisdom in thy youth; yea, learn in thy youth to keep the commandments of God.","used":true}]